{
    "data": "Quantum mechanics is a fundamental theory that describes the behavior of nature at and below the scale of atoms.[2]: 1.1  It is the foundation of all quantum physics, which includes quantum chemistry, quantum field theory, quantum technology, and quantum information science.\n\nQuantum mechanics can describe many systems that classical physics cannot. Classical physics can describe many aspects of nature at an ordinary (macroscopic and (optical) microscopic) scale, but is not sufficient for describing them at very small submicroscopic (atomic and subatomic) scales. Most theories in classical physics can be derived from quantum mechanics as an approximation valid at large (macroscopic/microscopic) scale.[3]\n\nQuantum systems have bound states that are quantized to discrete values of energy, momentum, angular momentum, and other quantities, in contrast to classical systems where these quantities can be measured continuously. Measurements of quantum systems show characteristics of both particles and waves (wave–particle duality), and there are limits to how accurately the value of a physical quantity can be predicted prior to its measurement, given a complete set of initial conditions (the uncertainty principle).\n\nQuantum mechanics arose gradually from theories to explain observations that could not be reconciled with classical physics, such as Max Planck's solution in 1900 to the black-body radiation problem, and the correspondence between energy and frequency in Albert Einstein's 1905 paper, which explained the photoelectric effect. These early attempts to understand microscopic phenomena, now known as the \"old quantum theory\", led to the full development of quantum mechanics in the mid-1920s by Niels Bohr, Erwin Schrödinger, Werner Heisenberg, Max Born, Paul Dirac and others. The modern theory is formulated in various specially developed mathematical formalisms. In one of them, a mathematical entity called the wave function provides information, in the form of probability amplitudes, about what measurements of a particle's energy, momentum, and other physical properties may yield.\n\nOverview and fundamental concepts\n\nQuantum mechanics allows the calculation of properties and behaviour of physical systems. It is typically applied to microscopic systems: molecules, atoms and sub-atomic particles. It has been demonstrated to hold for complex molecules with thousands of atoms,[4] but its application to human beings raises philosophical problems, such as Wigner's friend, and its application to the universe as a whole remains speculative.[5] Predictions of quantum mechanics have been verified experimentally to an extremely high degree of accuracy. For example, the refinement of quantum mechanics for the interaction of light and matter, known as quantum electrodynamics (QED), has been shown to agree with experiment to within 1 part in 10^12 when predicting the magnetic properties of an electron.[6]\n\nA fundamental feature of the theory is that it usually cannot predict with certainty what will happen, but only give probabilities. Mathematically, a probability is found by taking the square of the absolute value of a complex number, known as a probability amplitude. This is known as the Born rule, named after physicist Max Born. For example, a quantum particle like an electron can be described by a wave function, which associates to each point in space a probability amplitude. Applying the Born rule to these amplitudes gives a probability density function for the position that the electron will be found to have when an experiment is performed to measure it. This is the best the theory can do; it cannot say for certain where the electron will be found. The Schrödinger equation relates the collection of probability amplitudes that pertain to one moment of time to the collection of probability amplitudes that pertain to another.[7]: 67–87 \n\nOne consequence of the mathematical rules of quantum mechanics is a tradeoff in predictability between different measurable quantities. The most famous form of this uncertainty principle says that no matter how a quantum particle is prepared or how carefully experiments upon it are arranged, it is impossible to have a precise prediction for a measurement of its position and also at the same time for a measurement of its momentum.[7]: 427–435 \n\nAnother consequence of the mathematical rules of quantum mechanics is the phenomenon of quantum interference, which is often illustrated with the double-slit experiment. In the basic version of this experiment, a coherent light source, such as a laser beam, illuminates a plate pierced by two parallel slits, and the light passing through the slits is observed on a screen behind the plate.[8]: 102–111 [2]: 1.1–1.8  The wave nature of light causes the light waves passing through the two slits to interfere, producing bright and dark bands on the screen – a result that would not be expected if light consisted of classical particles.[8] However, the light is always found to be absorbed at the screen at discrete points, as individual particles rather than waves; the interference pattern appears via the varying density of these particle hits on the screen. Furthermore, versions of the experiment that include detectors at the slits find that each detected photon passes through one slit (as would a classical particle), and not through both slits (as would a wave).[8]: 109 [9][10] However, such experiments demonstrate that particles do not form the interference pattern if one detects which slit they pass through. This behavior is known as wave–particle duality. In addition to light, electrons, atoms, and molecules are all found to exhibit the same dual behavior when fired towards a double slit.[2]\n\nAnother non-classical phenomenon predicted by quantum mechanics is quantum tunnelling: a particle that goes up against a potential barrier can cross it, even if its kinetic energy is smaller than the maximum of the potential.[11] In classical mechanics this particle would be trapped. Quantum tunnelling has several important consequences, enabling radioactive decay, nuclear fusion in stars, and applications such as scanning tunnelling microscopy, tunnel diode and tunnel field-effect transistor.[12][13]\n\nWhen quantum systems interact, the result can be the creation of quantum entanglement: their properties become so intertwined that a description of the whole solely in terms of the individual parts is no longer possible. Erwin Schrödinger called entanglement \"...the characteristic trait of quantum mechanics, the one that enforces its entire departure from classical lines of thought\".[14] Quantum entanglement enables quantum computing and is part of quantum communication protocols, such as quantum key distribution and superdense coding.[15] Contrary to popular misconception, entanglement does not allow sending signals faster than light, as demonstrated by the no-communication theorem.[15]\n\nAnother possibility opened by entanglement is testing for \"hidden variables\", hypothetical properties more fundamental than the quantities addressed in quantum theory itself, knowledge of which would allow more exact predictions than quantum theory can provide. A collection of results, most significantly Bell's theorem, have demonstrated that broad classes of such hidden-variable theories are in fact incompatible with quantum physics. According to Bell's theorem, if nature actually operates in accord with any theory of local hidden variables, then the results of a Bell test will be constrained in a particular, quantifiable way. Many Bell tests have been performed and they have shown results incompatible with the constraints imposed by local hidden variables.[16][17]\n\nIt is not possible to present these concepts in more than a superficial way without introducing the actual mathematics involved; understanding quantum mechanics requires not only manipulating complex numbers, but also linear algebra, differential equations, group theory, and other more advanced subjects.[18][19] Accordingly, this article will present a mathematical formulation of quantum mechanics and survey its application to some useful and oft-studied examples.\n\nMathematical formulation\n\nMain article: Mathematical formulation of quantum mechanics\n\nIn the mathematically rigorous formulation of quantum mechanics, the state of a quantum mechanical system is a vector ψ belonging to a (separable) complex Hilbert space H. This vector is postulated to be normalized under the Hilbert space inner product, that is, it obeys ⟨ ψ , ψ ⟩ = 1, and it is well-defined up to a complex number of modulus 1 (the global phase), that is, ψ and e^(i α) ψ represent the same physical system. In other words, the possible states are points in the projective space of a Hilbert space, usually called the complex projective space. The exact nature of this Hilbert space is dependent on the system – for example, for describing position and momentum the Hilbert space is the space of complex square-integrable functions L^2(ℂ), while the Hilbert space for the spin of a single proton is simply the space of two-dimensional complex vectors ℂ² with the usual inner product.\n\nPhysical quantities of interest – position, momentum, energy, spin – are represented by observables, which are Hermitian (more precisely, self-adjoint) linear operators acting on the Hilbert space. A quantum state can be an eigenvector of an observable, in which case it is called an eigenstate, and the associated eigenvalue corresponds to the value of the observable in that eigenstate. More generally, a quantum state will be a linear combination of the eigenstates, known as a quantum superposition. When an observable is measured, the result will be one of its eigenvalues with probability given by the Born rule: in the simplest case the eigenvalue λ is non-degenerate and the probability is given by | ⟨ λ → , ψ ⟩ |², where λ → is its associated eigenvector. More generally, the eigenvalue is degenerate and the probability is given by ⟨ ψ , P λ ψ ⟩, where P λ is the projector onto its associated eigenspace. In the continuous case, these formulas give instead the probability density.\n\nAfter the measurement, if result λ was obtained, the quantum state is collapsed onto the corresponding eigenstate, which will be described by a corresponding new normalized state. The temporal evolution of a quantum state is described by the Schrödinger equation, which can be written in the form:\n\n∂ψ/∂t = −(i / ℏ) H ψ,\n\nwhere H is the Hamiltonian operator, representing the total energy of the system, and ℏ is the reduced Planck's constant. The time evolution of an observable is given by the Heisenberg equation of motion:\n\ndA/dt = (i / ℏ) [H,A] + ⟨ ∂A/∂t ⟩,\n\nwhere A is the operator corresponding to the observable, ⟨ ∂A/∂t ⟩ is its explicit time dependence, and [H,A] is the commutator. The second term gives the change of the observable due to external effects, such as interactions with other systems. This is equivalent to the more familiar time evolution of wave functions, leading to the concept of observables having time-dependent expectation values.\n\nCausality\n\nCausality is not a part of the fundamental mathematical structure of quantum mechanics. It is implicitly included, for example, by requiring that the measurements of observables, described by Hermitian operators, be ordered in time, and is found in non-relativistic quantum mechanics through the role of the Hamiltonian, but is not explicitly a part of quantum theory. In relativistic quantum field theories, locality is imposed as an axiom. Bell's theorem, as described above, demonstrated that local hidden variable theories cannot reproduce all the predictions of quantum mechanics; therefore, no causal interpretation of quantum mechanics that relies solely on local hidden variables can be correct. The implications of nonlocality as a consequence of quantum entanglement lead to a variety of interpretations of quantum mechanics.\n\nInterpretations of quantum mechanics\n\nMain article: Interpretations of quantum mechanics\n\nMany interpretations of quantum mechanics exist. Each of these interpretations attempts to make sense of quantum phenomena, especially wave–particle duality, measurement, and quantum entanglement. The oldest interpretation is the Copenhagen interpretation, which posits that physical systems generally do not have definite properties prior to measurement. Other interpretations, such as the many-worlds interpretation and pilot-wave theory, maintain that the properties of physical systems exist prior to measurement, but differ in their implications and ontological commitments. The no-hidden-variables theorem implies that the observables we measure do not originate from an underlying hidden reality but instead are fundamental properties of a quantum system.\n\nApplications\n\nQuantum mechanics has led to numerous practical applications, including:\n\n- Transistors and diodes (the building blocks of modern electronics)\n- Lasers\n- Atomic clocks\n- MRI scanners\n- Quantum computing\n- Cryptography and quantum key distribution\n\nScientific significance\n\nQuantum mechanics is widely regarded as one of the most successful theories in the history of science. Its development marked a shift from classical to modern physics. It provided a rigorous foundation for the development of modern chemistry and other fields of study. Quantum mechanics has been tested and verified through numerous experiments, yielding predictions that have consistently been confirmed to an extraordinary degree of precision. In this sense, it is one of the cornerstones of modern scientific thought."
}
